In [2]:
import pandas as pd
df_csv = pd.read_csv('emp.csv')
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eid     9 non-null      int64
 1   ename   9 non-null      object
 2   edept   9 non-null      object
 3   ecity   9 non-null      object
 4   ecost   9 non-null      int64
dtypes: int64(2), object(3)
memory usage: 492.0+ bytes

In [3]:
products = {}
products['pid']=[101,102,103,104,105]
products['pname']=['pA','pB','pC','pD','pE']
products['pcost']=[1000,234,4442,1230,4500]
import json
with open('test.json','w') as wobj:
    json.dump(products,wobj)

In [4]:
pd.read_json('test.json')

   pid pname  pcost
0  101    pA   1000
1  102    pB    234
2  103    pC   4442
3  104    pD   1230
4  105    pE   4500

In [5]:
df_json = pd.read_json('test.json')

In [7]:
df_excel = pd.read_excel('sales_data.xlsx')

In [8]:
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eid     9 non-null      int64
 1   ename   9 non-null      object
 2   edept   9 non-null      object
 3   ecity   9 non-null      object
 4   ecost   9 non-null      int64
dtypes: int64(2), object(3)
memory usage: 492.0+ bytes

In [9]:
df_json.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pid     5 non-null      int64
 1   pname   5 non-null      object
 2   pcost   5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [10]:
df_excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         3 non-null      int64
 1   product    3 non-null      object
 2   amount     3 non-null      int64
 3   sale_date  3 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 228.0+ bytes

In [15]:
import sqlite3
conn = sqlite3.connect('emp.db')
cur = conn.cursor()
cur.execute("create table emp(eid INT,ename TEXT,edept TEXT,ecost INT)")

In [16]:
cur.execute("insert into emp(eid,ename,edept,ecost) values(101,'Arun','sales',1000)")

In [17]:
cur.execute("insert into emp(eid,ename,edept,ecost) values(102,'Anu','HR',2000)")
cur.execute("insert into emp(eid,ename,edept,ecost) values(103,'vijay','Prod',3000)")
cur.execute("insert into emp(eid,ename,edept,ecost) values(104,'Leo','sales',4000)")
cur.execute("insert into emp(eid,ename,edept,ecost) values(105,'Paul','sales',5300)")
cur.execute("insert into emp(eid,ename,edept,ecost) values(106,'Bibu','admin',2100)")

In [18]:
conn.commit()

In [19]:
conn.close()

In [20]:
import sqlite3
conn = sqlite3.connect('emp.db')

In [21]:
pd.read_sql_query("select *from emp",conn)

   eid  ename  edept  ecost
0  101   Arun  sales   1000
1  102    Anu     HR   2000
2  103  vijay   Prod   3000
3  104    Leo  sales   4000
4  105   Paul  sales   5300
5  106   Bibu  admin   2100

In [22]:
df_db = pd.read_sql_query("select *from emp",conn)
df_db.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eid     6 non-null      int64
 1   ename   6 non-null      object
 2   edept   6 non-null      object
 3   ecost   6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [23]:
df_db.to_sql("new_emp",conn)

6

In [24]:
df_csv.to_csv("e1.csv")

In [ ]:
## Collective data (or) more than one values ---> single value
# -----------------------------------------
# [ ...... ] -> max,min,sum,count,avg,groupby...

In [25]:
data = {}
data['depts']=['prod','sales','HR','prod','sales','sales']
data['cost']=[6000,4500,7500,5500,3450,6200]
data['count']=[20,30,28,35,40,45]

df = pd.DataFrame(data)

In [26]:
df

   depts  cost  count
0   prod  6000     20
1  sales  4500     30
2     HR  7500     28
3   prod  5500     35
4  sales  3450     40
5  sales  6200     45

In [28]:
df['cost']

0    6000
1    4500
2    7500
3    5500
4    3450
5    6200
Name: cost, dtype: int64

In [29]:
df['cost'].sum()

np.int64(33150)

In [33]:
print(f"Sum = {df['cost'].sum()}")
print(f"Mean = {df['cost'].mean()}")
print(f"TotalCount = {df['cost'].count()}")

Sum = 33150
Mean = 5525.0
TotalCount = 6

In [34]:
print(f"Standard deviation = {df['cost'].std()}")

Standard deviation = 1409.8758810618756

In [35]:
print(f"Minimum Cost = {df['cost'].min()}")
print(f"Maximum Cost = {df['cost'].max()}")

Minimum Cost = 3450
Maximum Cost = 7500

In [37]:
# SQL 
# select dept,avg(cost) from emp group by dept;

df.groupby("depts")["cost"].mean()

depts
HR       7500.000000
prod     5750.000000
sales    4716.666667
Name: cost, dtype: float64

In [ ]:
df.groupby("depts")["cost"].mean()

In [38]:
df.groupby("depts")["cost"].max() # maximum cost

depts
HR       7500
prod     6000
sales    6200
Name: cost, dtype: int64

In [39]:
df.groupby("depts")["cost"].agg(['mean','max'])

              mean   max
depts
HR     7500.000000  7500
prod   5750.000000  6000
sales  4716.666667  6200

In [40]:
def salary_range(x):  #<== user defined function 
    r = x.max() - x.min()
    return r

df.groupby("depts")['cost'].agg(salary_range)

depts
HR          0
prod      500
sales    2750
Name: cost, dtype: int64

In [ ]:
def salary_range(x):  #<== user defined function 
    return  x.max() - x.min()
###################################################### // lambda 

df.groupby("depts")['cost'].agg(salary_range)

In [41]:
f = lambda x: x.max() - x.min()
df.groupby("depts")['cost'].agg(f)

depts
HR          0
prod      500
sales    2750
Name: cost, dtype: int64

In [42]:
df.groupby("depts")['cost'].agg(lambda x: x.max() - x.min())

depts
HR          0
prod      500
sales    2750
Name: cost, dtype: int64